/** @format */

import CallImage from "../../assets/images/contact/Call.webp";

import {
  CallCalling,
  Whatsapp,
  Clock,
  ShieldTick,
  Flash,
  Messages3,
} from "iconsax-reactjs";

export const contactData = {
  title: "آماده شروع پروژه بعدی شما هستم.",

  subtitle:
    "اگر برای طراحی وب‌سایت، توسعه اختصاصی وردپرس یا اجرای یک پروژه حرفه‌ای به دنبال همکاری با یک توسعه‌دهنده متعهد هستید، کافی است از طریق تماس تلفنی یا واتساپ با من در ارتباط باشید.",

  description:
    "هر پروژه قبل از شروع نیازمند بررسی دقیق، شناخت نیازها و انتخاب بهترین راهکار است. به همین دلیل پیش از شروع همکاری، زمان کافی برای بررسی پروژه شما اختصاص داده می‌شود تا بهترین نتیجه ممکن با توجه به اهداف، بودجه و زمان‌بندی ارائه شود.",

  image: CallImage,

  phone: {
    label: "تماس مستقیم",

    number: "0912-388-4766",

    href: "tel:+989123884766",

    icon: CallCalling,
  },

  whatsapp: {
    label: "واتساپ",

    number: "0912-388-4766",

    href: "https://wa.me/989123884766",

    icon: Whatsapp,
  },

  features: [
    {
      id: 1,
      icon: Clock,
      title: "پاسخگویی سریع",
      description:
        "در کوتاه‌ترین زمان ممکن پیام‌ها و تماس‌های شما بررسی و پاسخ داده می‌شود.",
    },

    {
      id: 2,
      icon: ShieldTick,
      title: "همکاری مطمئن",
      description:
        "شفافیت در روند انجام پروژه، تعهد به زمان‌بندی و کیفیت خروجی در اولویت قرار دارد.",
    },

    {
      id: 3,
      icon: Flash,
      title: "شروع سریع پروژه",
      description:
        "پس از بررسی نیازهای پروژه، فرآیند طراحی و توسعه بدون اتلاف زمان آغاز خواهد شد.",
    },

    {
      id: 4,
      icon: Messages3,
      title: "مشاوره قبل از همکاری",
      description:
        "در صورت نیاز، قبل از شروع پروژه می‌توانید درباره ایده، امکانات و مسیر اجرای آن مشاوره دریافت کنید.",
    },
  ],

  cta: {
    title: "بیایید ایده شما را به یک پروژه حرفه‌ای تبدیل کنیم.",

    description:
      "اگر برای کسب‌وکار یا برند خود به یک وب‌سایت سریع، مدرن و قابل توسعه نیاز دارید، همین حالا از طریق تماس یا واتساپ ارتباط برقرار کنید تا درباره جزئیات پروژه صحبت کنیم.",
  },
};
